<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */

    'failed' => 'Имя пользователя и пароль не совпадают.',
    'password' => 'The provided password is incorrect.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
    'blocked' => 'Ваша учетная запись приостановлена, обратитесь к администратору.',
    'verified' => 'Ваша учетная запись не верифицирована, перейдите по ссылке из письма.',
    'This action is unauthorized.' => 'У вас нет прав для выполнения этого действия.',
];
